<?php

return [

    // Tasks
    'task' => [
        'store' => [
            'success' => 'Задача успешно создана',
            'error' => 'Не удалось создать задачу',
        ],
        'update' => [
            'success' => 'Задача успешно изменена',
            'error' => 'Не удалось изменить задачу',
        ],
        'destroy' => [
            'success' => 'Задача успешно удалена',
            'error' => 'Нельзя удалить задачу, созданную другим пользователем',
        ],
    ],

    // Labels
    'label' => [
        'store' => [
            'success' => 'Метка успешно создана',
            'error' => 'Не удалось создать метку',
        ],
        'update' => [
            'success' => 'Метка успешно изменена',
            'error' => 'Не удалось изменить метку',
        ],
        'destroy' => [
            'success' => 'Метка успешно удалена',
            'error' => 'Не удалось удалить метку',
        ],
    ],

    // Task Statuses
    'task_status' => [
        'store' => [
            'success' => 'Статус успешно создан',
            'error' => 'Не удалось создать статус',
        ],
        'update' => [
            'success' => 'Статус успешно изменён',
            'error' => 'Не удалось изменить статус',
        ],
        'destroy' => [
            'success' => 'Статус успешно удалён',
            'error' => 'Не удалось удалить статус',
        ],
    ],

];
